### **SQL Challenge: Data Cleaning and Extraction**

**Scenario:**
You have a table called `students` that contains student records with messy names, grades, and other details. The goal is to clean the names, extract useful information, and create a summary report.

### **Table Structure: `students`**

| student_id | name                | grade | age | major             |
|------------|---------------------|-------|-----|--------------------|
| 1          | Alice123            | A     | 20  | Computer Science    |
| 2          | Bo*b@45             | B     | 21  | Mathematics         |
| 3          | Joh_n!Doe           | C     | 22  | Physics             |
| 4          | 1234                | D     | 19  | Chemistry           |
| 5          | E%ve                | A     | 23  | Biology             |
| 6          | Tom9!               | B     | 20  | Computer Science    |
| 7          | Ma_rie-89           | A     | 21  | Mathematics         |
| 8          | Sam@123             | C     | 22  | Physics             |
| 9          | Lin%da###           | D     | 19  | Chemistry           |
| 10         | Grace_01            | A     | 23  | Biology             |
| 11         | 0987                | B     | 20  | Computer Science    |
| 12         | Sophia$$            | A     | 21  | Mathematics         |
| 13         | William&&&          | C     | 22  | Physics             |
| 14         | !Andrew             | D     | 19  | Chemistry           |
| 15         | Christ-opher567     | A     | 23  | Biology             |
| 16         | Da vid_08           | B     | 20  | Computer Science    |
| 17         | 77_Olivia           | A     | 21  | Mathematics         |

### **Your Tasks:**

1. **Clean the `name` column**:
   - Remove any non-alphabetic characters from the names.
   - Replace empty names with "Unknown".

2. **Create a summary table** showing:
   - The number of students per major.
   - The average age of students per major.
   - The highest grade for each major.

In [1]:
%load_ext sql

In [2]:
%sql mysql+pymysql://root:password@localhost:3306/db_test

'Connected: root@db_test'

In [3]:
%sql SHOW tables

 * mysql+pymysql://root:***@localhost:3306/db_test
1 rows affected.

[('students',)]

In [4]:
%sql SELECT * FROM students

 * mysql+pymysql://root:***@localhost:3306/db_test
17 rows affected.

[(1, 'Alice123', 'A', 20, 'Computer Science'),
 (2, 'Bo*b@45', 'B', 21, 'Mathematics'),
 (3, 'Joh_n!Doe', 'C', 22, 'Physics'),
 (4, '1234', 'D', 19, 'Chemistry'),
 (5, 'E%ve', 'A', 23, 'Biology'),
 (6, 'Tom9!', 'B', 20, 'Computer Science'),
 (7, 'Ma_rie-89', 'A', 21, 'Mathematics'),
 (8, 'Sam@123', 'C', 22, 'Physics'),
 (9, 'Lin%da###', 'D', 19, 'Chemistry'),
 (10, 'Grace_01', 'A', 23, 'Biology'),
 (11, '0987', 'B', 20, 'Computer Science'),
 (12, 'Sophia$$', 'A', 21, 'Mathematics'),
 (13, 'William&&&', 'C', 22, 'Physics'),
 (14, '!Andrew', 'D', 19, 'Chemistry'),
 (15, 'Christ-opher567', 'A', 23, 'Biology'),
 (16, 'Da vid_08', 'B', 20, 'Computer Science'),
 (17, '77_Olivia', 'A', 21, 'Mathematics')]

In [5]:
%%sql
-- A temporary table is created by selecting from the `students` table and cleaning up the names.
CREATE TEMPORARY TABLE IF NOT EXISTS cleaned_table AS
WITH cleaned_table AS(
    -- Select the student ID, clean the name by removing non-alphabetic characters using REGEXP_REPLACE,
    -- and retain the grade, age, and major columns from the `students` table.
    SELECT
        student_id,
        REGEXP_REPLACE(name, '[^a-zA-Z]', '') AS cleaned_name,  -- Remove non-alphabetic characters
        grade, 
        age, 
        major
    FROM students
)

-- Final SELECT to handle empty cleaned names.
-- If the cleaned name is empty (""), replace it with "Unknown".
SELECT 
    student_id,
    CASE 
        WHEN cleaned_name = "" THEN "Unknown"  -- Replace empty names with "Unknown"
        ELSE cleaned_name                      -- Otherwise, retain the cleaned name
    END AS cleaned_name,
    grade, 
    age, 
    major
FROM cleaned_table;

-- Display the first two rows from the `cleaned_table` for validation
SELECT * FROM cleaned_table LIMIT 2;

 * mysql+pymysql://root:***@localhost:3306/db_test
17 rows affected.
2 rows affected.

[(1, 'Alice', 'A', 20, 'Computer Science'), (2, 'Bob', 'B', 21, 'Mathematics')]

In [7]:
%%sql
-- Select the major, count of students per major, average age of students, and the highest grade per major
SELECT 
    major, 
    COUNT(*) AS number_of_students,  -- Count the number of students in each major
    ROUND(AVG(age), 2) AS average_age,  -- Calculate the average age for each major, rounded to 2 decimal places
    MAX(grade) AS highest_grade  -- Get the highest grade for each major
FROM cleaned_table
GROUP BY major;  -- Group the results by major to calculate the aggregated values for each group

 * mysql+pymysql://root:***@localhost:3306/db_test
5 rows affected.

[('Computer Science', 4, Decimal('20.00'), 'B'),
 ('Mathematics', 4, Decimal('21.00'), 'B'),
 ('Physics', 3, Decimal('22.00'), 'C'),
 ('Chemistry', 3, Decimal('19.00'), 'D'),
 ('Biology', 3, Decimal('23.00'), 'A')]